{
  "projects": [
    {
      "key": "p0",
      "primary": true,
      "title": "Beaver County Humane Society Foster Portal",
      "date": "Spring 17",
      "responsibilities": [
        {
          "key": "p0_0",
          "content": "- Worked with a small team to fix bugs and improve functionality of the",
          "className": ""
        },
        {
          "key": "p0_1",
          "content": "BCHS Foster Portal, which doubled the amount of users over six months",
          "className": "indent"
        },
        {
          "key": "p0_2",
          "content": "- Architected and coded a design overhaul to improve the user",
          "className": ""
        },
        {
          "key": "p0_3",
          "content": "experience, while also expanding application use to mobile devices.",
          "className": "indent"
        }
      ],
      "fullContent":{
        "fullTitle": "Beaver County Humane Society Foster Portal",
        "content": {
          "course": "67-373: Software Development Project",
          "link": "http://foster.beavercountyhumanesociety.org/",
          "text": "My Senior Spring, I took 67-373: Software Development Project, a course which places IS students into groups of three or four and has them work with non-profits to analyze processes and (usually) develop software solutions to improve their workplace. \n\nThis course was normally the Information Systems course that we should take during our Junior Spring; however, I was studying abroad at that time, and so I took a course at TU Dresden to replace 373. That being said, it was an experience that I really wanted to have, so after some discussion with my advisor, I was allowed to take it my senior year (thanks Gary!).\n\nNow this course is dedicated to two things: allowing students to build real world experience, and helping improve the community, from local Pittsburgh non-profits to schools across the country (one group had the opportunity to work with a school in Alaska).\n\nI, along with two of my classmates, had the opportunity to be paired with the Beaver County Humane Society. The thing that made this project unique was that it was actually the continuation of a project that was started in 2016, so going into it, our client had a strong idea of what they needed, as they had a compiled list of bugs that had to be fixed. Therefore, we spent a majority of our semester working on these bugs. However, there was one drastic problem that we noticed existing in the application, and that was the total lack of design put into the project, so this is where I took the lead.\n\nHaving just worked on a few personal projects with Website Design, most of the topics were still fresh in my mind. I began the redesign by exploring existing static theme ideas and using this research to build them a real landing page. From here, it was a process of going through the existing content and making it match the homepage design. But I went even further. Near the beginning they had discussed the idea of building an app for their Foster Portal. I addressed this by making the entire application mobile friendly and editing the search-bars to turn into popout menus to make the overall experience more friendly to mobile. \n\nEspecially near the end of the semester, I put many more hours in than was required, but it was worth it. I was able to enhance the project to be something that truly had the BCHS stamp on it. These were wonderful people and they deserved a wonderful project that they can use to save lives.",
          "categories": [
            "desktop",
            "mobile"
          ],
          "pictures": [
            {
              "title": "Home",
              "category": "desktop",
              "src": "./images/projects/bchs/home.png"
            },
            {
              "title": "Form",
              "category": "desktop",
              "src": "./images/projects/bchs/form.png"
            },
            {
              "title": "Landing",
              "category": "desktop",
              "src": "./images/projects/bchs/landing.png"
            },
            {
              "title": "Log-In",
              "category": "desktop",
              "src": "./images/projects/bchs/login.png"
            },
            {
              "title": "Home",
              "category": "mobile",
              "src": "./images/projects/bchs/m-home.png"
            },
            {
              "title": "Landing",
              "category": "mobile",
              "src": "./images/projects/bchs/m-landing.png"
            },
            {
              "title": "Menu",
              "category": "mobile",
              "src": "./images/projects/bchs/m-menu.png"
            },
            {
              "title": "Search",
              "category": "mobile",
              "src": "./images/projects/bchs/m-search.png"
            }
          ]
        }
      }
    },
    {
      "key": "p1",
      "primary": true,
      "title": "CMU Soundbytes Website",
      "date": "Spring 17",
      "responsibilities": [
        {
          "key": "p1_0",
          "content": "- Revitalized a website that hadn’t been updated since 2005 using Jekyll",
          "className": ""
        },
        {
          "key": "p1_1",
          "content": "and GitHub Pages, leading to a more public presence for the group",
          "className": "indent"
        }
      ],
      "fullContent":{
        "fullTitle": "CMU Soundbytes Website",
        "content": {
          "client": "Soundbytes A Cappella Group",
          "link": "https://www.cmusoundbytes.com/",
          "text": "At the beginning my sophomore year, I auditioned and was accepted into the SoundBytes a cappella group. Music (next to computers) has always been one of the greatest passions of my life. Pretty soon, it became my most involved extracurricular at CMU.\n\nMy Senior Spring, I found out that we actually had an old website, and so I went to look it up. Putting it nicely, it was pretty terrible. Someone had made it back in the early 2000’s and there was no real sense of design. So I recruited Sean (both a fellow IS major and Bass in the group) to help try and create something better.\n\nI began the development of the project using Jekyll, a gem/static-site generator that is integrated with Ruby, and I found an existing theme to get an idea of how the gem worked. It was pretty cool, because it allowed the use of markdown throughout the project while also allowing it to be broken up into multiple files. This made development significantly easier, allowing Sean and I to work simultaneously by using GitHub without having to worry about the merge conflicts that normally come with single page sites. I was in charge of most of the development while Sean addressed the more detailed design features. Working on this project was really what kicked off my work into website creation and design, and without it, I never would have attempted making this site.\n\nThe site itself is still running today and hosted on GitHub Pages, being currently managed by members currently in the group (though I have been contacted with questions about maintenance so I still contribute at points). The hope is that the site will continue to grow, and hopefully will be the future location for all of our content.",
          "categories": [
            "desktop"
          ],
          "pictures": [
            {
              "title": "Home",
              "category": "desktop",
              "src": "./images/projects/soundbytes/landing.png"
            },
            {
              "title": "Members",
              "category": "desktop",
              "src": "./images/projects/soundbytes/members.png"
            },
            {
              "title": "Posts",
              "category": "desktop",
              "src": "./images/projects/soundbytes/posts.png"
            }
          ]
        }
      }
    },
    {
      "key": "p2",
      "primary": true,
      "title": "CMU Safety Pin",
      "date": "Fall 16",
      "responsibilities": [
        {
          "key": "p2_0",
          "content": "- Participated in a team tasked with the goal of creating an innovation in",
          "className": ""
        },
        {
          "key": "p2_1",
          "content": "Health and Safety on the CMU Campus",
          "className": "indent"
        },
        {
          "key": "p2_2",
          "content": "- Researched, designed, and developed an iOS application with an",
          "className": ""
        },
        {
          "key": "p2_3",
          "content": "interactive map-based UI to consolidate safety information",
          "className": "indent"
        },
        {
          "key": "p2_4",
          "content": "- The application shows vital locations on campus, such as emergency",
          "className": ""
        },
        {
          "key": "p2_5",
          "content": "phones, while also following active shuttles and detailing crime alerts",
          "className": "indent"
        }
      ],
      "fullContent":{
        "fullTitle": "CMU Safety Pin",
        "content": {
          "course": "67-475: Innovation in Information Systems",
          "text": "My Senior Fall, I took 67-475: Innovation in Information Systems, a course which places IS students into groups of three or four with a focus on innovation. The course itself is broken up into two sections: a shorter 5-week project, and a larger 10-week project. The earlier project was more of an introduction to the course, and there was no real theme beyond “innovate.” However, the second project was given the constraint of creating an innovation in Healthcare and Wellness at CMU.\n\nWhen my group first got together, we brainstormed different aspects of health that we could try and innovate on, and through discussion, we ended up on the topic of campus safety. What started as an idea for an application that links friends together in order to ensure that they get home safely turned into SafetyPin: an all-encompassing CMU safety application idea that was heavily map-based and linked all of the campus safety information together (such as the locations of shuttles, Blue Lights, crime alerts, etc.).\n\nMost of my contribution revolved around the development of the iOS front end, and creating most of the interactive front-end in Xcode. This involved creating the sliding displays, pop-up notifications, part of the interactive maps, and a unifying design throughout the application. This project definitely helped me develop my UI/UX skills, while also creating more of a foundation with my Swift skills.\n\nThe project developed to the point where we were communicating with CMU Police in order to try and have this possibly be an official application managed by them. The project itself is currently still in the development stages, with the hope that it can eventually make a CMU a safer place.",
          "categories": [
            "mobile",
            "development"
          ],
          "pictures": [
            {
              "title": "Log In",
              "category": "mobile",
              "src": "./images/projects/safetypin/log-in.png"
            },
            {
              "title": "Emergency Contacts",
              "category": "mobile",
              "src": "./images/projects/safetypin/emergency.png"
            },
            {
              "title": "Crime Reports",
              "category": "mobile",
              "src": "./images/projects/safetypin/crimeReports.png"
            },
            {
              "title": "Xcode",
              "category": "development",
              "src": "./images/projects/safetypin/xcode.png"
            }
          ]
        }
      }
    }
  ]
}
