{
  "work": [
    {
      "key": "w0",
      "primary": true,
      "position": "Tech. Consultant",
      "location": "Ministry of Education, Koror, Palau",
      "date": "Summer 17",
      "responsibilities": [
        {
          "key": "w0_0",
          "content": "- Developed the first Teacher Evaluation System for Palau, a full-stack",
          "className": ""
        },
        {
          "key": "w0_1",
          "content": "Ruby on Rails solution that allows access to over 200 employees",
          "className": "indent"
        },
        {
          "key": "w0_2",
          "content": "- Consolidated over 6 years of existing observation data resulting in the",
          "className": ""
        },
        {
          "key": "w0_3",
          "content": "ability to analyze and improve teaching throughout the country",
          "className": "indent"
        }
      ],
      "fullContent":{
        "fullTitle": "Technology Consultant",
        "content": {
          "client": "Ministry of Education",
          "location": "Korror, Palau",
          "link": "https://www.cmu.edu/global/education/tcingc/",
          "text": "As I was taking 67-373, my professor Joseph Mertz gave a short talk about the Technology Consulting in the Global Community (TC in the GC) program. When he started describing past projects and the effects that past students had had, I knew that I would regret not applying for the program. Then about two weeks before graduation, I received an email saying that I had been accepted, and that I would be flying out to Palau a week after I graduated.\n\nI spent the summer of 2017 working for Palau's Ministry of Education. The project itself involved revitalizing the system for teacher observations, which was previously all paper/excel based.\n\nI spent the first few weeks analyzing the process and trying to find an existing solution that could be used to solve their problem. However, after these few weeks and discussion with the teaching specialists, the managers, and the tech support, every existing solution was too large and not catered enough to their needs. So, despite the tradeoff of immediate sustainability, it was decided that a custom full-stack solution would be the best approach for this project.\n\nI spent the rest of the summer developing a Ruby on Rails solution due to my experience in the language and the speed in which development can happen. It was quite the challenge though, as I was developing an entire full-stack web application in 6 weeks, and so I developed the front-end and back-end simultaneously. I started the front-end by using a static template and then plugging in aspects of material design and linking the controllers. The back-end was run using a MySQL database to match what is currently used in the different MoE servers. Then in the last week, it was a mad dash to ensure that the server could get up and running. I spent most of those nights integrating the application with the current log-in server that was run at the MoE and finally served it off of Apache with a day to spare. The project itself also has the basis to be built upon for future expansion and will be worked on by CMU student-consultants in the following four years.\n\nOutside of working for the MoE, I got the chance to become certified in scuba diving while also overcoming one of the greatest fears of my early life: water. I almost drowned a few times when I was little, and therefore I didn’t learn how to swim until I was 12. I still hate the feeling of water on my face and felt completely vulnerable under water. So taking this opportunity allowed me to confront that fear. I can proudly say that I am a certified PADI Open-Water Diver, and without the TC in the GC program, I would never have had the chance.\n\nThis experience was amongst the greatest in my life. Nothing can really compare to flying halfway around the world and getting the chance to affect the education system of an entire country. I will truly remember this for the rest of my life.",
          "categories": [
            "desktop",
            "tablet"
          ],
          "pictures": [
            {
              "title": "Log-In",
              "category": "desktop",
              "src": "./images/work/palau/log-in.png"
            },
            {
              "title": "Landing",
              "category": "desktop",
              "src": "./images/work/palau/landing.png"
            },
            {
              "title": "Form",
              "category": "desktop",
              "src": "./images/work/palau/form.png"
            },
            {
              "title": "Teacher's Observations",
              "category": "desktop",
              "src": "./images/work/palau/teacher.png"
            },
            {
              "title": "Analysis",
              "category": "desktop",
              "src": "./images/work/palau/analysis.png"
            },
            {
              "title": "Landing",
              "category": "tablet",
              "src": "./images/work/palau/m-landing.png"
            },
            {
              "title": "Form",
              "category": "tablet",
              "src": "./images/work/palau/m-form.png"
            },
            {
              "title": "Observation",
              "category": "tablet",
              "src": "./images/work/palau/m-observation.png"
            }
          ]
        }
      }
    },
    {
      "key": "w1",
      "primary": true,
      "position": "Teaching Assistant",
      "location": "App Design and Development",
      "date": "Spring 17",
      "responsibilities": [
        {
          "key": "w1_0",
          "content": "- Worked as a TA for the sophomore Information Systems course",
          "className": ""
        },
        {
          "key": "w1_1",
          "content": "- Graded exams and projects, while also running weekly labs to help up",
          "className": ""
        },
        {
          "key": "w1_2",
          "content": "to 20 sophomores improve their web application development skills",
          "className": "indent"
        }
      ],
      "fullContent":{
        "fullTitle": "Teaching Assistant",
        "content": {
          "client": "Carnegie Mellon University",
          "location": "Pittsburgh, PA",
          "link": "http://67272.cmuis.net/",
          "text": "As an Information Systems major, we are required to take 67-272: App Design and Development our sophomore year.  It is a course that is focused on teaching IS students how to build web applications and it is first programming heavy course specifically for IS majors.\n\nBefore this course, I had my doubts about majoring in Information Systems. All of the computer science courses that I was taking had us building more and just doing things that I considered to be a lot more fun. But when I finally took this course with Prof. Heimann, I knew that this was the major for me. That’s why I was extremely excited when I was offered the chance to be a Teaching Assistant for this course.\n\nBeing a TA involved three main responsibilities: grading exams and projects, running labs, and proctoring exams. \n\nBefore I actually started working, I felt as if I didn’t know enough to actually teach these students. But after the first lab started, I realized that I knew way more than I thought I did about programming and helping students debug and understand their code. This is why the experience of being a TA was a major step for me in being a software developer.",
          "categories": [
            "desktop"
          ],
          "pictures": [
            {
              "title": "Landing Page",
              "category": "desktop",
              "src": "./images/work/272ta/ta-page.png"
            }
          ]
        }
      }
    },
    {
      "key": "w2",
      "primary": true,
      "position": "Camp Counselor",
      "location": "Bear Creek Camp",
      "date": "Summers 14-16",
      "responsibilities": [
        {
          "key": "w2_0",
          "content": "- Managed groups of 10-20 children weekly at a stay-away camp",
          "className": ""
        },
        {
          "key": "w2_1",
          "content": "- Cultivated campers’ growth and teamwork skills through group building",
          "className": ""
        },
        {
          "key": "w2_2",
          "content": "activities, while teaching them about nature through hikes and games",
          "className": "indent"
        }
      ],
      "fullContent":{
        "fullTitle": "Camp Counselor",
        "content": {
          "client": "Bear Creek Camp",
          "location": "Bear Creek, PA",
          "link": "http://bearcreekcamp.org/",
          "text": "When I was 9 years old, I went to a sleep-away camp called Bear Creek Camp, and I have three distinct memories: I had a tick embedded in my head, I ended up getting lice, and I made a girl cry at the dance because I was too scared to dance with her. It’s safe to say that I didn’t go back.\n\nFast forwarding about a decade, my mom brings BCC up again because a new person is running the camp: a guy that my parents had met in Germany while he was touring with a band called Captive Free. The spring semester was coming to a close, and I needed a summer job, so I decided to apply and pretty soon I was hired.\n\nI worked as a camp counselor for 2 full summers (2014 and 2015). The responsibilities included being responsible for a different group of children every week between the ages of 8 and 18 for 8 weeks. This would also involve taking those children out into the woods at least once every week.\n\nIn 2016, I worked for the summer's two busiest weeks, immediately following studying abroad in Dresden.\nIn 2017, I worked for the summer's final week, immediately following working in Palau.\n\nMany interviewers ask me why I would choose to work at a summer camp over a summer internship, but I would easily make the same choice again. I learned a lot while working at BCC. It’s actually surprising that there is so much overlap between being a counselor and a project manager. You’re constantly on a schedule, while constantly handling twenty odd things coming at you at any given time. I really believe that if you can take twenty 10 year olds out into the woods and not only have them survive, but also have fun, then you can manage any project.",
          "categories": [
            "pictures"
          ],
          "pictures": [
            {
              "title": "Webpage",
              "category": "pictures",
              "src": "./images/work/bcc/website.png"
            },
            {
              "title": "Coworkers",
              "category": "pictures",
              "src": "./images/work/bcc/sylvia.png"
            },
            {
              "title": "Brave Little Toaster",
              "category": "pictures",
              "src": "./images/work/bcc/toaster.png"
            }
          ]
        }
      }
    }
  ]
}
